import i11 from "./images/i11.png";
import i12 from "./images/i12.png";
import i13 from "./images/i13.png";
import i21 from "./images/i21.png";
import i22 from "./images/i22.png";
import i23 from "./images/i23.png";
import i31 from "./images/i31.png";
import i32 from "./images/i32.png";
import i33 from "./images/i33.png";
import i41 from "./images/i41.png";
import i42 from "./images/i42.png";
import i43 from "./images/i43.png";

import r1 from "./images/r1.png";
import r2 from "./images/r2.png";
import r3 from "./images/r3.png";
import r4 from "./images/r4.png";
import r5 from "./images/r5.png";
import r6 from "./images/r6.png";
import r7 from "./images/r7.png";
import r8 from "./images/r8.png";
import r9 from "./images/r9.png";
import r10 from "./images/r10.png";
import r11 from "./images/r11.png";
import r12 from "./images/r12.png";
import r13 from "./images/r13.png";
import r14 from "./images/r14.png";

import rv1 from "./images/rv1.svg";
import rv2 from "./images/rv2.svg";
import rv3 from "./images/rv3.svg";
import rv4 from "./images/rv4.svg";
import rv5 from "./images/rv5.svg";
import rv6 from "./images/rv6.svg";
import rv7 from "./images/rv7.svg";
import rv8 from "./images/rv8.svg";
import rv9 from "./images/rv9.svg";
import rv10 from "./images/rv10.svg";
import rv11 from "./images/rv11.svg";
import rv12 from "./images/rv12.svg";
import rv13 from "./images/rv13.svg";
import rv14 from "./images/rv14.svg";

import bu1 from "./images/bu1.png";
import bu2 from "./images/bu2.png";
import bu3 from "./images/bu3.png";
import bu4 from "./images/bu4.png";

export const prices = {
  "iPhone 15": {
    "128 GB": {
      "Обычная цена": "79990₽",
      "Цена со скидкой": "67991₽",
      "Сумма возврата": "17597₽",
      "Цена с TAX-Free": "62392₽",
    },
    "256 GB": {
      "Обычная цена": "89990₽",
      "Цена со скидкой": "76491₽",
      "Сумма возврата": "19797₽",
      "Цена с TAX-Free": "70192₽",
    },
    "512 GB": {
      "Обычная цена": "96990₽",
      "Цена со скидкой": "82441₽",
      "Сумма возврата": "21337₽",
      "Цена с TAX-Free": "75652₽",
    },
    "1TB": {},
  },
  "iPhone 15 Plus": {
    "128 GB": {
      "Обычная цена": "93990₽",
      "Цена со скидкой": "79891₽",
      "Сумма возврата": "20677₽",
      "Цена с TAX-Free": "73312₽",
    },
    "256 GB": {
      "Обычная цена": "102500₽",
      "Цена со скидкой": "87125₽",
      "Сумма возврата": "22550₽",
      "Цена с TAX-Free": "79950₽",
    },
    "512 GB": {
      "Обычная цена": "114990₽",
      "Цена со скидкой": "97741₽",
      "Сумма возврата": "25297₽",
      "Цена с TAX-Free": "89692₽",
    },
    "1TB": {},
  },
  "iPhone 15 Pro": {
    "128 GB": {
      "Обычная цена": "111990₽",
      "Цена со скидкой": "95191₽",
      "Сумма возврата": "24637₽",
      "Цена с TAX-Free": "87352₽",
    },
    "256 GB": {
      "Обычная цена": "126990₽",
      "Цена со скидкой": "107941₽",
      "Сумма возврата": "27937₽",
      "Цена с TAX-Free": "99052₽",
    },
    "512 GB": {
      "Обычная цена": "152990₽",
      "Цена со скидкой": "130041₽",
      "Сумма возврата": "33657₽",
      "Цена с TAX-Free": "119332₽",
    },
    "1TB": {
      "Обычная цена": "164990₽",
      "Цена со скидкой": "140241₽",
      "Сумма возврата": "36297₽",
      "Цена с TAX-Free": "128692₽",
    },
  },
  "iPhone 15 Pro Max": {
    "128 GB": {},
    "256 GB": {
      "Обычная цена": "134990₽",
      "Цена со скидкой": "114741₽",
      "Сумма возврата": "29697₽",
      "Цена с TAX-Free": "105292₽",
    },
    "512 GB": {
      "Обычная цена": "169990₽",
      "Цена со скидкой": "144491₽",
      "Сумма возврата": "37400₽",
      "Цена с TAX-Free": "132600₽",
    },
    "1TB": {
      "Обычная цена": "179990₽",
      "Цена со скидкой": "152991₽",
      "Сумма возврата": "39597₽",
      "Цена с TAX-Free": "140392₽",
    },
  },
};

export const infoIphons = {
  "iPhone 15": {
    display: `6,1'' , Super Retina XDR OLED, 2556х1179, стекло Ceramic Shield.`,
    chipset: "A16 Bionic",
    ram: "6 ГБ",
    time: "Воспроизве­дение видео: до 20 часов, Просмотр видео в режиме стриминга: до 16 часов, Воспроизве­дение аудио: до 80 часов",
    camera: "48+12+12 Мп",
    connections: "5G, Wi-Fi 6, Bluetooth 5.3, GPS, USB Type-C.",
    other: "защита от пыли и воды IP68, Apple Pay, лицевой сканер Face ID.",
    colors: "черный, синий, зеленый, желтый и розовый.",
    image: [i11, i12, i13],
    description: (
      <>
        <p>
          <strong>iPhone 15</strong> обладает прочным титановым корпусом и
          мощным процессором Bionic A17. При этом экран iPhone 15 имеет
          диагональ 6,2", а емкость аккумулятора составляет 3877 мАч.
        </p>
        <p>
          <strong>Также девайс оснастили разъемом USB Type-C</strong> для
          зарядки или подключения гаджетов и овальным Dynamic Island.
        </p>
      </>
    ),
  },

  "iPhone 15 Plus": {
    display: `6,7" , Super Retina XDR OLED, 2796х1290, стекло Ceramic Shield.`,
    chipset: "A16 Bionic",
    ram: "6 ГБ",
    time: "Воспроизве­дение видео: до 20 часов, Просмотр видео в режиме стриминга: до 16 часов, Воспроизве­дение аудио: до 80 часов",
    camera: "48+12+12 Мп",
    connections: "5G, Wi-Fi 6, Bluetooth 5.3, GPS, USB Type-C.",
    other: "защита от пыли и воды IP68, Apple Pay, лицевой сканер Face ID.",
    colors: "черный, синий, зеленый, желтый и розовый.",
    image: [i21, i22, i23],

    description: (
      <>
        <p>
          <strong> iPhone 15 Plus</strong> обладает прочным титановым корпусом и
          мощным процессором Bionic A17. При этом экран iPhone 15 Plus имеет
          диагональ 6,7", а емкость аккумулятора составляет 4912 мАч.
        </p>
        <p>
          <strong>Также девайс оснастили разъемом USB Type-C</strong> для
          зарядки или подключения гаджетов и овальным Dynamic Island.
        </p>
      </>
    ),
  },
  "iPhone 15 Pro": {
    id: 3,
    display: `6,1'' , Super Retina XDR OLED, 2556х1179, стекло Ceramic Shield.`,
    chipset: "A17 Pro Bionic",
    ram: "6 ГБ",
    time: "Воспроизве­дение видео: до 20 часов, Просмотр видео в режиме стриминга: до 16 часов, Воспроизве­дение аудио: до 80 часов",
    camera: "48+12+12 Мп",
    connections: "5G, Wi-Fi 6, Bluetooth 5.3, GPS, USB Type-C.",
    other: "защита от пыли и воды IP68, Apple Pay, лицевой сканер Face ID.",
    colors:
      "титановый черный, титановый синий, титановый белый, титановый бежевый",
    image: [i31, i32, i33],
    description: (
      <>
        <p>
          <strong>iPhone 15 Pro </strong>имеет прочный титановый корпус и
          работает на мощном процессоре Bionic A17. Диагональ экрана у девайса
          составляет 6,2", а емкость аккумулятора – 3650 мАч.
        </p>
        <p>
          <strong>Также, в отличие от 15/15 Plus </strong> версия Pro имеет
          камеру с телевиком на 12 Мп, 3-кратным приближением без потери
          качества и перископным модулем с 5- или 6-кратным зумом.
        </p>
      </>
    ),
  },
  "iPhone 15 Pro Max": {
    display: `6,7" , Super Retina XDR OLED, 2796х1290, стекло Ceramic Shield.`,
    chipset: "A17 Pro Bionic",
    ram: "8 ГБ",
    time: "Воспроизве­дение видео: до 20 часов, Просмотр видео в режиме стриминга: до 16 часов, Воспроизве­дение аудио: до 80 часов",
    camera: "48+12+12 Мп",
    connections: "5G, Wi-Fi 6, Bluetooth 5.3, GPS, USB Type-C.",
    other: "защита от пыли и воды IP68, Apple Pay, лицевой сканер Face ID.",
    colors:
      "титановый черный, титановый синий, титановый белый, титановый бежевый",
    image: [i41, i42, i43],
    description: (
      <>
        <p>
          <strong>iPhone 15 Pro Max </strong>имеет прочный титановый корпус и
          работает на мощном процессоре Bionic A17. Диагональ экрана у девайса
          составляет 6,7", а емкость аккумулятора – 4852 мАч.
        </p>
        <p>
          <strong>Также, в отличие от 15/15 Plus</strong> версия Pro Max имеет
          камеру с телевиком на 12 Мп, 3-кратным приближением без потери
          качества и перископным модулем с 5- или 6-кратным зумом.
        </p>
      </>
    ),
  },
};

export const reviews = [
  {
    image: r1,
    avatar: rv1,
    text: "Купил в данном магазине iPhone 15 pro и Pro Max на 512 gb. Могу со 100% уверенностью сказать, что предложили лучшую цену, потому как перед покупкой промониторил все пункты продажи Девушка-консультант доступно и терпеливо всё рассказала. Ну это просто пушка.",
    name: "Виктор Ерофеев",
  },
  {
    image: r2,
    avatar: rv2,
    text: "Большое спасибо магазину! Приобрела IPhone 13, много отзывов читала, боялась приобретать, но теперь не жалею. Телефон очень хороший, покупкой довольна.Сервис магазина отличный, продавец хороший, отзывчивый, доставка точно ко времени, что очень удобно)",
    name: "Галина Аневич",
  },
  {
    image: r3,
    avatar: rv3,
    text: "Этот магазин рекомендовали друзья: «проверенный!не пожалеешь»И я не пожалелаПриобрела 14 Pro, при чем по очень вкусной цене. Доставили по предоплате за 2 дня. Всем довольнаБлагодарю",
    name: "Алия Севостьянова",
  },
  {
    image: r4,
    avatar: rv4,
    text: `Спасибо, ещё раз💋
  Это не первая моя покупка в этом магазине , теперь к своему iPhone приобрела часы.
  Как всегда все на высоте, спасибо !!💃`,
    name: " Дина Суворова",
  },
  {
    image: r5,
    avatar: rv5,
    text: "Это уже не первая моя покупка в данном магазине! В этот раз заказала у ребят iPhone 14 Pro Max 256gb! Качество 100% Очень довольна своим новым телефоном! Спасибо ещё раз! Цена обрадовала)))",
    name: "Татьяна Семенова",
  },
  {
    image: r6,
    avatar: rv6,
    text: "Очень быстрая доставка, спасибо большое за телефон, всем довольна😊за подарочки отдельное спасибо🥰",
    name: "Резида Закирова",
  },
  {
    image: r7,
    avatar: rv7,
    text: `Покупкой очень довольна!
  Быстрая доставка👍
  Отличное обслуживание 👍`,
    name: "Камилла Анисимова",
  },
  {
    image: r8,
    avatar: rv8,
    text: "Это уже не первая моя покупка в данном магазине! В этот раз заказала у ребят iPhone 14 Pro Max 256gb! Качество 100% Очень довольна своим новым телефоном! Спасибо ещё раз! Цена обрадовала)))",
    name: "Ольга Каберник",
  },
  {
    image: r9,
    avatar: rv9,
    text: "Наконец-то получили доставку нашего макбука😎 Спасибо большое вам и всему коллективу магазина)) Муж довольный как слон😋",
    name: "Евгения Крупенина",
  },
  {
    image: r10,
    avatar: rv10,
    text: `Только что доставили! Спасибо большое, Русский язык поддерживает!😍 Телефон хоть и Б.У, но в идеальном состоянии! Всё соответствует отчёту!😍
  Очень жду возврат TAX-Free, обещали до 3 июня 👍`,
    name: "Валерия Синицина",
  },
  {
    image: r11,
    avatar: rv11,
    text: "Только что получила доставку! Как и обещали курьер дал время проверить телефон на включение и сверить все номера на официальном сайте! Спасибо вам большое! Буду рекомендовать друзьям",
    name: "Вероника Староватова",
  },
  {
    image: r12,
    avatar: rv12,
    text: "Спасибо большое! Доставили за 5 дней, жду возврата по такс фри 😊",
    name: "Ростислав Сахаров",
  },
  {
    image: r13,
    avatar: rv13,
    text: `Купила оригинальные наушники AirPods Pro
  Доставка заняла 6 дней
  Спасибо большое, буду рекомендовать друзьям`,
    name: "Регина Козлова",
  },
  {
    image: r14,
    avatar: rv14,
    text: `СПАСИБО БОЛЬШОЕ ВАМ 😍😍😍
  КУПИЛИ ДВА КРАСАВЦА 14 PRO MAX ФИОЛЕТОВЫЕ!!!!🥰
  Муж просто без ума от телефона!!! Мы в восторге!!!
  Вы самый лучший магазин!😘`,
    name: "Ярослава Маркова",
  },
];

export const dataQuestionsAnswers = [
  {
    id: 1,
    question: "Что такое кешбэк по Tax free и как его получить?",
    answer:
      "Tax free – это система возврата суммы налога (НДС) при заказе товара из Дубая, что позволяет экономить при покупке техники до 22%.",
  },
  {
    id: 2,
    question: "Какие условия получения скидки 15% и возврата 22% по Tax free?",
    answer: `Заказ девайса по системе Tax free возможен только при условии полной предоплаты и в двух вариантах:
  1) Скидка 15%, которую вы получите сразу;
  2) Возврат 22% от суммы, которые вы получите
  в течение 7 дней с момента оплаты.`,
  },
  {
    id: 3,
    question: `Какие условия рассрочки и кредита?`,
    answer: `Вы сможете приобрести смартфон в рассрочку 0% сроком до 12 месяцев или в кредит до 2-х лет со ставкой 9,5% годовых. При этом оформление кредита или рассрочка возможно онлайн. Подробности уточняйте у нашего менеджера.`,
  },
  {
    id: 4,
    question: `Что входит в комплект устройства?`,
    answer: `При заказе вы получите полный заводской комплект, который включает в себя: коробку, смартфон, шнур, скрепку, а также адаптер для розетки в подарок от нашего магазина!`,
  },
  {
    id: 5,
    question: `Можно ли заказать у вас товар без предоплаты?`,
    answer: `Да, вы можете заказать у нас наложенным платежом чехлы и защитные стекла, но техника отправляется с минимальной предоплатой от 20%. Часто перед покупкой самого устройства у нас заказывают что-либо из аксессуаров (без предоплаты), чтобы убедиться в добропорядочности нашего магазина и наличии товара.`,
  },
  {
    id: 6,
    question: `Вы продаете только новые устройства Apple?`,
    answer: `Нет, мы занимаемся как новой, так и б/у техникой. Но если говорить конкретно об iPhone 15 – у нас пока нет б/у предложений по данной модели, поскольку она совсем недавно поступила в продажу. Сейчас мы продаем только новые iPhone 15.`,
  },
  {
    id: 7,
    question: `Как получить информацию о состоянии устройства при заказе б/у техники?`,
    answer: `По любому б/у устройству вы можете запросить у нас диагностический лист, в котором содержится важная информация о состоянии, гарантии и комплекте устройства. Политика нашего магазина – предоставлять к продаже только тот б/у товар, который находится в идеальном состоянии.`,
  },
  {
    id: 8,
    question: `Возможен ли возврат товара, если мне что-то не понравится?`,
    answer: `Да, конечно – у нас действует система возврата товара в течение 14 календарных дней, на протяжении которых вы можете вернуть устройство. При этом возврат средств происходит по реквизитам банковской карты клиента в срок до 3 рабочих дней с момента обращения.`,
  },
  {
    id: 9,
    question: `Ваша компания работает и зарегистрирована официально?`,
    answer: `Да, конечно – на нашем сайте представлены сканы оригинальных документов (ТТН «Торг-12», договор к-п и поставки товаров, публичная оферта, выписка из ЕГРЮЛ) и другие документы.`,
  },
  {
    id: 10,
    question: `Как я могу быть уверен, что вам можно доверять?`,
    answer: `У нас есть 2 магазина в Оренбурге, а чехлы и защитные стекла мы высылаем наложенным платежом, без предоплаты. Вы можете заказать любой недорогой аксессуар, чтобы проверить наш магазин, или же посетить нас лично.`,
  },
  {
    id: 12,
    question: `Какие условия официальной гарантии на смартфоны Apple?`,
    answer: `В течение срока гарантии (1 год), любой клиент может обратиться в авторизированный сервисный центр от Apple и получить бесплатный ремонт, независимо от места покупки устройства. Карту доступных АСЦ вы можете посмотреть здесь. Если же вы закажете б/у устройство и по нему истечет срок официальной гарантии – мы предоставим вам 6 месяцев гарантии с ремонтом в нашем сервисе в Оренбурге.`,
  },
  {
    id: 11,
    question: `Какие документы нужно иметь при себе, чтобы воспользоваться гарантией?`,
    answer: `Обязательно сохраняйте кассовый, товарный чеки и упаковку в течение всего гарантийного срока.`,
  },
];

export const usedIPhones = [
  { name: "Б.У iPhone 14 Pro Max", price: "99 990 ₽", img: bu1 },
  { name: "Б.У iPhone 14 Pro", price: "79 990 ₽", img: bu2 },
  { name: "Б.У iPhone 13 Pro Max", price: "79 990 ₽", img: bu3 },
  { name: "Б.У iPhone 13 Pro", price: "59 990 ₽", img: bu4 },
];
